{
  "backend/main.mo": "Main Motoko actor implementing user authentication, portfolio/watchlist/journal management, alert history storage, and HTTP outcalls for fetching crypto news and price data from external APIs.",
  "backend/migration.mo": "Migration module that handles state upgrades by preserving existing userData and initializing empty alertHistories map for backward compatibility.",
  "feature_evidence.json": "Feature evidence report documenting implemented features including toast notifications for trading signals, alert history page with filters, and market heatmap visualization with file mappings and test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend TypeScript/React files including pages, components, hooks, services, and utility modules for the crypto trading application.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark theme color schemes using OKLCH color space for consistent theming across the application.",
  "frontend/index.html": "HTML entry point for the React application with viewport meta tag and root div mounting point.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for Dashboard, CryptoDetail, Portfolio, Journal, and Alerts pages, wrapped in ThemeProvider with toast notifications.",
  "frontend/src/components/AddPositionDialog.tsx": "Dialog component for adding cryptocurrency positions to portfolio with symbol selection dropdown and quantity input, integrated with usePortfolio hook for mutations.",
  "frontend/src/components/AddTradeDialog.tsx": "Dialog component for adding new trades to the journal with form fields for crypto, direction, entry/exit prices, quantity, date, rationale, and notes. Validates input and calls the addTrade hook to persist the trade.",
  "frontend/src/components/AlertCard.tsx": "Card component displaying a trading alert with crypto info, signal badge (buy/sell/hold), price at trigger, timestamp, confidence level, and trigger reason. Formats and displays alert data with appropriate icons and styling.",
  "frontend/src/components/AlertFilters.tsx": "Filter controls for alerts page with dropdowns for cryptocurrency and signal type (buy/sell/hold) selection, plus a reset button. Manages filter state and provides callbacks for filter changes.",
  "frontend/src/components/AuthButton.tsx": "Authentication button component that toggles between login and logout states using Internet Identity. Initializes user preferences on first login.",
  "frontend/src/components/CandlestickChart.tsx": "Line chart component using Recharts to display OHLC price data with optional support/resistance levels as reference lines. Transforms raw OHLC data into chart-ready format.",
  "frontend/src/components/CryptoTable.tsx": "Table component displaying cryptocurrency market data with columns for rank, name, price, 24h change, volume, market cap, and trading signals. Includes watchlist toggle functionality for authenticated users.",
  "frontend/src/components/IndicatorsPanel.tsx": "Dashboard panel displaying technical indicators including RSI, MACD, moving averages (SMA/EMA), and Bollinger Bands in a grid of cards. Color-codes RSI values based on overbought/oversold conditions.",
  "frontend/src/components/JournalFilters.tsx": "Filter controls for the trading journal with a search input and outcome dropdown (all/profit/loss). Manages filter state through callbacks to parent component.",
  "frontend/src/components/JournalStats.tsx": "Displays trading journal statistics including total trades, win rate, total P/L, and average P/L in a grid of cards. Calculates metrics from completed trades with exit prices.",
  "frontend/src/components/Layout.tsx": "Main application layout component with sticky header, navigation menu (Market, Portfolio, Journal, Alerts), theme toggle, auth button, mobile sheet menu, and footer with caffeine.ai attribution.",
  "frontend/src/components/MarketSentimentPanel.tsx": "Displays market sentiment analysis in three cards: overall sentiment with fear/greed index, top 3 gainers, and top 3 losers based on 24h price changes.",
  "frontend/src/components/PatternLegend.tsx": "Shows detected candlestick patterns as colored badges (bullish, bearish, or neutral) in a card component.",
  "frontend/src/components/PortfolioSummary.tsx": "Displays portfolio overview with three metrics: total value, number of positions, and average position size calculated from current prices and quantities.",
  "frontend/src/components/PositionCard.tsx": "Card component for individual portfolio position showing crypto name/image, quantity, current price, total value, and a delete button.",
  "frontend/src/components/SignalBadge.tsx": "Badge component displaying trading signal type (buy/sell/hold) with icon and tooltip showing reason, confidence, and indicator details.",
  "frontend/src/components/ThemeToggle.tsx": "Theme toggle button that switches between light/dark mode and persists preference to backend via Internet Identity actor when authenticated.",
  "frontend/src/components/TimeframeSelector.tsx": "Tab selector component for choosing chart timeframe between 1H, 4H, and Daily intervals.",
  "frontend/src/components/TradeCard.tsx": "Card displaying individual trade details including direction, entry/exit prices, quantity, date, P/L calculation, rationale, and notes with delete functionality.",
  "frontend/src/components/TradingSignalsPanel.tsx": "Two-column panel showing active trading signals with badges and support/resistance levels detected from technical analysis.",
  "frontend/src/components/WatchlistPanel.tsx": "React component that displays a user's cryptocurrency watchlist in a card grid, showing crypto images, prices, 24h price changes, and allowing removal of items from the watchlist.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and manages an ICP backend actor instance based on Internet Identity authentication state, automatically invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAlertHistory.ts": "Custom React hook providing queries and mutations for managing trading alerts, including fetching alert history with filters, 24-hour alerts, alert statistics, and operations to save and clear alerts.",
  "frontend/src/hooks/useAlertNotifications.ts": "Custom React hook that monitors top cryptocurrencies for trading signals and displays toast notifications when signals are detected, saving them to the backend alert system.",
  "frontend/src/hooks/useChartData.ts": "Custom React hook that fetches OHLC (candlestick) data for a cryptocurrency, detects candlestick patterns, and calculates support/resistance levels based on the selected timeframe.",
  "frontend/src/hooks/useCryptoPrices.ts": "Custom React hook that fetches and caches market data for the top 30 cryptocurrencies, with automatic refetching every 45 seconds.",
  "frontend/src/hooks/useInternetIdentity.ts": "Custom React hook and provider for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validity with configurable AuthClient options.",
  "frontend/src/hooks/useJournal.ts": "Custom React hook for managing a trading journal with CRUD operations for trades and client-side filtering by search term, cryptocurrency, and profit/loss outcome.",
  "frontend/src/hooks/usePortfolio.ts": "Custom React hook that provides queries and mutations for managing a user's cryptocurrency portfolio positions, including adding and removing positions with loading states.",
  "frontend/src/hooks/useTechnicalIndicators.ts": "Custom React hook that calculates technical indicators (RSI, MACD, SMA, EMA, Bollinger Bands) from OHLC data for a given cryptocurrency and timeframe.",
  "frontend/src/hooks/useTradingSignals.ts": "Custom React hook that generates trading signals (buy/sell/hold) by analyzing technical indicators for a specific cryptocurrency and timeframe.",
  "frontend/src/hooks/useWatchlist.ts": "React hook that manages user watchlist operations using React Query, providing methods to fetch, add, remove, and check if a coin is in the watchlist.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components and setting base typography styles.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the main App component.",
  "frontend/src/pages/Alerts.tsx": "Alert history page displaying trading signal statistics (buy/sell/hold counts) with filtering capabilities and authentication requirement.",
  "frontend/src/pages/CryptoDetail.tsx": "Detailed cryptocurrency view page showing price charts, technical indicators, trading signals, and support/resistance levels with timeframe selection.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page displaying market overview with crypto table, watchlist panel, market sentiment, and auto-refresh functionality.",
  "frontend/src/pages/Journal.tsx": "Trading journal page for authenticated users to log and track trades with statistics, filters, and add/view trade functionality.",
  "frontend/src/pages/Portfolio.tsx": "Portfolio management page showing user's cryptocurrency holdings with performance metrics, requiring authentication to add and track positions.",
  "frontend/src/services/coingecko.ts": "Service layer for fetching cryptocurrency market data and OHLC (candlestick) data from the CoinGecko API.",
  "frontend/src/utils/candlestickPatterns.ts": "Utility functions to detect common candlestick patterns (Doji, Hammer, Shooting Star, Engulfing) from OHLC data for technical analysis.",
  "frontend/src/utils/marketSentiment.ts": "Calculates overall market sentiment (bullish/bearish/neutral) based on average 24h price changes, computes a fear/greed index, and identifies top 5 gainers and losers from cryptocurrency market data.",
  "frontend/src/utils/supportResistance.ts": "Identifies support and resistance levels by finding local minima and maxima in OHLC data, merges similar levels within a 2% threshold, and returns the top 5 strongest levels sorted by strength.",
  "frontend/src/utils/technicalIndicators.ts": "Provides calculation functions for technical indicators including RSI, MACD, SMA, EMA, and Bollinger Bands using historical price data arrays.",
  "frontend/src/utils/tradingSignals.ts": "Generates buy/sell/hold trading signals based on technical indicators (RSI oversold/overbought conditions and MACD crossovers) with confidence levels and reasoning.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, container queries, typography plugin, custom animations, and responsive breakpoints for a crypto trading dashboard.",
  "project_state.json": "Project metadata defining a crypto swing trading dashboard with features including real-time price tracking, technical indicators, portfolio tracking, Internet Identity authentication, and React/TypeScript frontend with Motoko backend."
}