{
  "backend/main.mo": "Main Motoko backend actor defining user data types (watchlist, portfolio, journal, alerts), state management with Maps, and public functions for user initialization, news/price fetching via HTTP outcalls, position/watchlist/journal management, and alert history tracking.",
  "feature_evidence.json": "Feature evidence report documenting the requirement to update AITradeAnalysisCard component to prominently display entry point price at the top with color coding, formatting, and visual hierarchy.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including pages, components, hooks, services, and utilities for the crypto trading application with technical indicators, signals, and portfolio management.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme color schemes including background, foreground, primary, secondary, muted, accent, destructive, border, and chart colors.",
  "frontend/index.html": "HTML entry point for the Crypto Swing Trader application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for Dashboard, CryptoDetail, Portfolio, Journal, and Alerts pages, wrapped in ThemeProvider and Toaster for notifications.",
  "frontend/src/components/AddPositionDialog.tsx": "Dialog component for adding portfolio positions with cryptocurrency selection dropdown and quantity input, using usePortfolio hook for mutation and toast notifications.",
  "frontend/src/components/AddTradeDialog.tsx": "Dialog component for adding new trades to the journal with form fields for crypto, direction, entry/exit prices, quantity, date, rationale, and notes. Validates inputs and submits trades via the useJournal hook.",
  "frontend/src/components/AITradeAnalysisCard.tsx": "AI-powered trade analysis card component displaying trade recommendations with direction, confidence, risk level, entry/exit points, take-profit targets, stop-loss, and reasoning based on technical indicators, signals, patterns, and support/resistance levels.",
  "frontend/src/components/AlertCard.tsx": "Card component displaying a trading alert with crypto info, signal badge (buy/sell/hold), price at trigger, timestamp, confidence level, and trigger reason. Formats and displays alert data with appropriate icons and styling.",
  "frontend/src/components/AlertFilters.tsx": "Filter controls for alerts page with dropdowns for cryptocurrency and signal type (buy/sell/hold) selection, plus a reset button. Manages filter state and passes changes to parent component.",
  "frontend/src/components/AuthButton.tsx": "Authentication button that toggles between login and logout states using Internet Identity. Initializes user preferences on first login.",
  "frontend/src/components/CandlestickChart.tsx": "Line chart component using Recharts to display OHLC price data with optional support/resistance levels as reference lines. Formats data for visualization with responsive container.",
  "frontend/src/components/CryptoTable.tsx": "Table component displaying cryptocurrency market data with columns for rank, name, price, 24h change, volume, market cap, and trading signals. Includes watchlist toggle functionality and links to detail pages.",
  "frontend/src/components/IndicatorsPanel.tsx": "Panel displaying technical indicators including RSI, MACD, moving averages (SMA/EMA), and Bollinger Bands in a grid of cards. Color-codes values based on thresholds (oversold/overbought).",
  "frontend/src/components/JournalFilters.tsx": "Filter controls for the trading journal with a search input and outcome dropdown (all/profit/loss). Manages filter state through props.",
  "frontend/src/components/JournalStats.tsx": "Displays trading journal statistics including total trades, win rate, total P/L, and average P/L in a grid of cards. Calculates metrics from completed trades with exit prices.",
  "frontend/src/components/Layout.tsx": "Main application layout component with sticky header, navigation menu (Market, Portfolio, Journal, Alerts), theme toggle, authentication button, and responsive mobile sheet menu. Includes footer with attribution link.",
  "frontend/src/components/MarketSentimentPanel.tsx": "Displays market sentiment analysis in three cards: overall sentiment with fear/greed index, top gainers, and top losers based on 24h price changes. Uses calculateMarketSentiment utility to process crypto market data.",
  "frontend/src/components/PatternLegend.tsx": "Shows detected candlestick patterns as colored badges (bullish, bearish, or neutral) in a card. Deduplicates patterns by name before display.",
  "frontend/src/components/PortfolioSummary.tsx": "Displays portfolio overview with three metrics: total value, number of positions, and average position size. Calculates values from positions with current prices.",
  "frontend/src/components/PositionCard.tsx": "Card component for individual portfolio position showing crypto name/image, quantity, current price, and total value with a delete button. Handles position removal via usePortfolio hook.",
  "frontend/src/components/SignalBadge.tsx": "Badge component displaying trading signal type (buy/sell/hold) with icon and tooltip showing signal reason, confidence, and indicator. Uses color-coded variants for different signal types.",
  "frontend/src/components/ThemeToggle.tsx": "Theme toggle button switching between light and dark modes. Syncs theme preference with backend via Internet Identity and actor when authenticated.",
  "frontend/src/components/TimeframeSelector.tsx": "Tab selector component for choosing chart timeframe between 1H, 4H, and Daily intervals. Uses controlled tabs component with callback for selection changes.",
  "frontend/src/components/TradeCard.tsx": "Card displaying individual trade details including direction, entry/exit prices, quantity, date, P/L calculation, rationale, and notes. Includes delete functionality via useJournal hook.",
  "frontend/src/components/TradingSignalsPanel.tsx": "Two-column panel showing active trading signals with badges and support/resistance levels. Displays signal details including reason, indicator, and confidence level.",
  "frontend/src/components/WatchlistPanel.tsx": "React component that displays a user's cryptocurrency watchlist with prices, 24h changes, and remove functionality. Shows error states with retry button and filters cryptos based on user's saved watchlist.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages an ICP actor instance based on Internet Identity authentication state. Invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useAlertHistory.ts": "Provides hooks for managing trading alerts including fetching alert history with filters, last 24 hours alerts, alert statistics, and mutations for saving and clearing alerts. Includes a specialized hook for fetching alerts by cryptocurrency.",
  "frontend/src/hooks/useAlertNotifications.ts": "Hook that monitors top 10 cryptocurrencies every 60 seconds for trading signals and displays toast notifications when signals are detected. Saves alerts to backend with confidence levels and signal types.",
  "frontend/src/hooks/useChartData.ts": "Fetches OHLC (candlestick) data for a cryptocurrency and calculates candlestick patterns and support/resistance levels based on the selected timeframe (1H, 4H, Daily).",
  "frontend/src/hooks/useCryptoPrices.ts": "React Query hook that fetches top 30 cryptocurrencies market data with automatic refetching every 45 seconds and retry logic with exponential backoff.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login/logout state, identity persistence, and delegation validity. Includes provider component and status tracking for the authentication flow.",
  "frontend/src/hooks/useJournal.ts": "Manages trading journal functionality with CRUD operations for trades and client-side filtering by search term, cryptocurrency, and profit/loss outcome. Returns filtered trades based on user-defined filter state.",
  "frontend/src/hooks/usePortfolio.ts": "Hook for managing user's cryptocurrency portfolio positions with queries for fetching positions and mutations for adding/removing positions. Extends Position type with current price and display metadata.",
  "frontend/src/hooks/useTechnicalIndicators.ts": "Calculates technical indicators (RSI, MACD, SMA, EMA, Bollinger Bands) from OHLC data for a given cryptocurrency and timeframe. Returns the most recent values for each indicator.",
  "frontend/src/hooks/useTradingSignals.ts": "Generates trading signals (buy/sell/hold) based on technical indicators for a cryptocurrency and timeframe. Depends on useTechnicalIndicators hook and returns an array of trading signals.",
  "frontend/src/hooks/useWatchlist.ts": "React hook that manages watchlist operations using TanStack Query, providing methods to fetch, add, remove, and check if a coin is in the user's watchlist.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components and typography styles.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/Alerts.tsx": "Alert history page displaying trading signal statistics (buy/sell/hold counts) with filtering capabilities and authentication requirement.",
  "frontend/src/pages/CryptoDetail.tsx": "Detailed cryptocurrency view page showing price charts, technical indicators, trading signals, and AI analysis with timeframe selection.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page displaying market overview with crypto table, watchlist panel, market sentiment, and auto-refresh functionality every 45 seconds.",
  "frontend/src/pages/Journal.tsx": "Trading journal page for authenticated users to track and analyze trade performance with filtering, statistics, and add trade functionality.",
  "frontend/src/pages/Portfolio.tsx": "Portfolio management page for authenticated users to view holdings, track performance, and add/manage cryptocurrency positions.",
  "frontend/src/services/coingecko.ts": "CoinGecko API service providing functions to fetch top cryptocurrency market data and OHLC (candlestick) price data.",
  "frontend/src/utils/aiTradeRecommendations.ts": "Generates AI-powered trade recommendations with entry points, take-profit targets (conservative/moderate/aggressive), stop-loss levels, confidence scores, and risk assessments based on technical indicators, trading signals, candlestick patterns, and support/resistance levels.",
  "frontend/src/utils/candlestickPatterns.ts": "Detects candlestick patterns (Doji, Hammer, Shooting Star, Bullish/Bearish Engulfing) from OHLC data and classifies them as bullish, bearish, or neutral with descriptions.",
  "frontend/src/utils/marketSentiment.ts": "Calculates overall market sentiment (bullish/bearish/neutral), fear/greed index, and identifies top gainers and losers based on 24-hour price changes across cryptocurrencies.",
  "frontend/src/utils/supportResistance.ts": "Identifies support and resistance levels by detecting local minima and maxima in OHLC data, merges similar levels within a 2% threshold, and ranks them by strength.",
  "frontend/src/utils/technicalIndicators.ts": "Implements technical indicator calculations including RSI, MACD, SMA, EMA, and Bollinger Bands using historical price data.",
  "frontend/src/utils/tradingSignals.ts": "Generates buy/sell/hold trading signals with confidence levels based on RSI oversold/overbought conditions and MACD crossovers from technical indicators.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions for colors (using OKLCH), fonts (Inter, JetBrains Mono), animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state document tracking a crypto swing trading dashboard with known issues including CoinGecko API rate limiting and missing entry point price display in the AI Trade Analysis card component."
}