{
  "backend/main.mo": "Main Motoko actor implementing user authentication, preferences management, crypto news/price fetching via HTTP outcalls, alert history persistence, and transformation functions for external API responses.",
  "feature_evidence.json": "Feature evidence report documenting implemented features for staggered API request batching, client-side caching, partial data rendering, and enhanced retry logic with associated test IDs and confidence levels.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend TypeScript/React files including components, pages, hooks, services, and utilities for the crypto trading dashboard application.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark theme color schemes using oklch color space for the application's design system.",
  "frontend/index.html": "HTML entry point loading Rajdhani and JetBrains Mono fonts from Google Fonts and mounting the React application at the root div.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for Dashboard, CryptoDetail, and Alerts pages, wrapped in ThemeProvider (dark mode) and Layout with Toaster notifications.",
  "frontend/src/components/AddPositionDialog.tsx": "Empty file placeholder for add position dialog component.",
  "frontend/src/components/AddTradeDialog.tsx": "Empty file placeholder for add trade dialog component.",
  "frontend/src/components/AITradeAnalysisCard.tsx": "Card component displaying AI-generated trade recommendations with confidence scores, risk levels, entry/exit prices, stop-loss/take-profit targets, and reasoning based on technical indicators, signals, patterns, and support/resistance levels.",
  "frontend/src/components/AlertCard.tsx": "Displays a single trading alert as a card with crypto info, signal type (buy/sell/hold), trigger reason, timestamp, and visual styling including glows and borders based on signal type.",
  "frontend/src/components/AlertFilters.tsx": "Provides dropdown filters for alerts by cryptocurrency and signal type (buy/sell/hold), with a reset button to clear all active filters.",
  "frontend/src/components/AuthButton.tsx": "Renders a login/logout button that integrates with Internet Identity authentication and initializes user preferences on first login.",
  "frontend/src/components/CandlestickChart.tsx": "Displays a line chart with price data, technical indicators, support/resistance levels, candlestick patterns, and trade recommendations with entry/exit markers; includes error handling and retry functionality.",
  "frontend/src/components/CryptoTable.tsx": "Renders a table of cryptocurrencies with market data (price, 24h change, volume, market cap) and real-time trading signals calculated from technical indicators; includes per-row error handling and retry.",
  "frontend/src/components/IndicatorsPanel.tsx": "Displays technical indicators (RSI, MACD, moving averages, Bollinger Bands) in a grid of cards with color-coded values and visual effects for extreme conditions.",
  "frontend/src/components/JournalFilters.tsx": "Empty file with no content.",
  "frontend/src/components/JournalStats.tsx": "Empty file with no content.",
  "frontend/src/components/Layout.tsx": "Main layout component with header, navigation, API health monitoring banner, theme toggle, and authentication button. Includes mobile menu sheet and sticky header with neon-styled branding.",
  "frontend/src/components/MarketSentimentPanel.tsx": "Displays market sentiment analysis with fear/greed index, overall sentiment badge (bullish/bearish/neutral), and lists of top gainers and losers in a three-card grid layout.",
  "frontend/src/components/PatternLegend.tsx": "Shows detected candlestick patterns as colored badges (bullish/bearish/neutral) in a card with wrapped layout.",
  "frontend/src/components/PortfolioSummary.tsx": "Empty component file with no implementation.",
  "frontend/src/components/PositionCard.tsx": "Empty component file with no implementation.",
  "frontend/src/components/SignalBadge.tsx": "Displays a trading signal (buy/sell/hold) as a badge with icon and tooltip showing reason, confidence, and indicator details.",
  "frontend/src/components/ThemeToggle.tsx": "Theme toggle button that switches between light/dark modes and persists user preference to backend via Internet Identity actor.",
  "frontend/src/components/TimeframeSelector.tsx": "Tab selector for switching between 1H, 4H, and Daily chart timeframes.",
  "frontend/src/components/TradeCard.tsx": "Empty component file with no implementation.",
  "frontend/src/components/TradingSignalsPanel.tsx": "Two-card panel displaying active trading signals with badges and support/resistance levels with prices.",
  "frontend/src/components/WatchlistPanel.tsx": "Empty component file with no implementation.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with Internet Identity authentication, invalidating dependent queries when actor changes.",
  "frontend/src/hooks/useAlertHistory.ts": "Provides queries and mutations for managing alert history including filtering, 24-hour alerts, stats, saving new alerts, and clearing alerts via the backend actor.",
  "frontend/src/hooks/useAlertNotifications.ts": "Monitors top 10 cryptocurrencies every 60 seconds for trading signals, displays toast notifications for new signals, and saves alerts to backend.",
  "frontend/src/hooks/useApiHealthMonitor.ts": "Monitors API health by analyzing React Query cache for crypto-related queries, calculating success rates, and returning health status (healthy/degraded/issues) with color and message.",
  "frontend/src/hooks/useChartData.ts": "Fetches OHLC data for a given coin and timeframe, then detects candlestick patterns and calculates support/resistance levels using React Query.",
  "frontend/src/hooks/useCryptoPrices.ts": "Fetches top 30 cryptocurrencies with staggered batch loading on initial load, implements retry logic with exponential backoff, and auto-refetches every 45 seconds.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation.",
  "frontend/src/hooks/useJournal.ts": "Empty file with no content.",
  "frontend/src/hooks/usePortfolio.ts": "Empty file with no content.",
  "frontend/src/hooks/useTechnicalIndicators.ts": "Calculates technical indicators (RSI, MACD, SMA, EMA, Bollinger Bands) from OHLC data for a given coin and timeframe using React Query.",
  "frontend/src/hooks/useTradingSignals.ts": "Generates trading signals based on technical indicators for a given coin and timeframe, using React Query with dependency on indicator data.",
  "frontend/src/hooks/useWatchlist.ts": "Empty file with no content.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with cyberpunk dark theme using OKLCH colors, custom glow effects, animations, and utility classes for neon-styled UI elements.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/Alerts.tsx": "Displays trading alert history with filtering by crypto and signal type, showing statistics cards and requiring Internet Identity authentication to view alerts.",
  "frontend/src/pages/CryptoDetail.tsx": "Displays detailed cryptocurrency information including candlestick charts, technical indicators, trading signals, and AI-generated trade recommendations with entry/exit points. Supports multiple timeframes (1H, 4H, Daily) and fetches data using custom hooks.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page showing market overview with a crypto table, market sentiment panel, and timeframe selector. Implements auto-refresh every 45 seconds and displays loading/error states with retry logic.",
  "frontend/src/pages/Journal.tsx": "Empty file placeholder for a trading journal feature.",
  "frontend/src/pages/Portfolio.tsx": "Empty file placeholder for a portfolio management feature.",
  "frontend/src/services/coingecko.ts": "CoinGecko API service with response caching (35s TTL) and request deduplication for fetching cryptocurrency market data and OHLC (candlestick) data. Includes TypeScript interfaces for market data structures.",
  "frontend/src/utils/aiTradeRecommendations.ts": "Generates AI-powered trade recommendations by analyzing technical indicators, trading signals, candlestick patterns, and support/resistance levels. Calculates entry points, take-profit targets (conservative/moderate/aggressive), stop-loss levels, and confidence scores.",
  "frontend/src/utils/candlestickPatterns.ts": "Detects candlestick patterns (Doji, Hammer, Shooting Star, Bullish/Bearish Engulfing) from OHLC data and provides trading action recommendations for each pattern.",
  "frontend/src/utils/marketSentiment.ts": "Calculates overall market sentiment (bullish/bearish/neutral) and a fear/greed index based on average 24h price changes, plus identifies top gainers and losers.",
  "frontend/src/utils/supportResistance.ts": "Identifies support and resistance levels from OHLC data by detecting local minima and maxima, merges similar levels within a 2% threshold, and ranks by strength.",
  "frontend/src/utils/technicalIndicators.ts": "Defines TechnicalIndicators interface and implements calculation functions for RSI, MACD, SMA, EMA, and Bollinger Bands using price array inputs.",
  "frontend/src/utils/tradingSignals.ts": "Generates buy/sell/hold trading signals based on technical indicators (RSI oversold/overbought and MACD crossovers) with confidence levels.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with cyberpunk theme colors (neon cyan/purple/green/red), custom fonts (Rajdhani, JetBrains Mono), OKLCH color system, and custom animations including pulse-glow effects.",
  "project_state.json": "Project state document describing a crypto swing trading dashboard with cyberpunk UI, CoinGecko API integration, technical indicators, and known issues related to API rate limiting and data loading failures."
}