{
  "backend/main.mo": "Main backend actor with user authentication, preferences management (theme, notifications), alert history persistence, and HTTP outcall functions for fetching crypto news and price data from external APIs.",
  "backend/migration.mo": "Migration module that transforms old user data structure (with portfolio, watchlist, and journal) to new simplified structure (preferences only), removing portfolio and journal state.",
  "feature_evidence.json": "Feature evidence report documenting removal of Portfolio and Journal features, implementation of cyberpunk color scheme, and other UI/UX changes with file paths and test IDs.",
  "frontend-file-summaries.txt": "Text file containing JSON-formatted summaries of all frontend source files including pages, components, hooks, services, and utility modules.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS properties defining light and dark theme color schemes using oklch color space for backgrounds, foregrounds, borders, and UI elements.",
  "frontend/index.html": "HTML entry point loading Rajdhani and JetBrains Mono fonts from Google Fonts and mounting the React app at #root div.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for Dashboard, CryptoDetail, and Alerts pages, wrapped in ThemeProvider (forced dark mode) and Layout component.",
  "frontend/src/components/AddPositionDialog.tsx": "Empty file (portfolio feature removed).",
  "frontend/src/components/AddTradeDialog.tsx": "Empty file (journal feature removed).",
  "frontend/src/components/AITradeAnalysisCard.tsx": "Card component displaying AI-generated trade recommendations with confidence scores, risk levels, entry/exit prices, stop-loss/take-profit targets, and reasoning based on technical indicators and patterns.",
  "frontend/src/components/AlertCard.tsx": "Displays an individual alert card with crypto info, signal type (buy/sell/hold), trigger reason, timestamp, and dynamic styling based on signal type with neon glow effects.",
  "frontend/src/components/AlertFilters.tsx": "Provides dropdown filters for cryptocurrency and signal type selection with a reset button to clear all active filters.",
  "frontend/src/components/AuthButton.tsx": "Renders a login/logout button that integrates with Internet Identity and initializes user preferences on first login.",
  "frontend/src/components/CandlestickChart.tsx": "Displays a line chart with price data, support/resistance levels as reference lines, and technical indicators using Recharts with neon-themed styling.",
  "frontend/src/components/CryptoTable.tsx": "Renders a table of cryptocurrencies with market data, price changes, and trading signals generated from technical indicators for each row.",
  "frontend/src/components/IndicatorsPanel.tsx": "Displays technical indicators (RSI, MACD, Moving Averages, Bollinger Bands) in a grid of cards with color-coded values and special highlighting for extreme RSI conditions.",
  "frontend/src/components/JournalFilters.tsx": "Empty file with no content.",
  "frontend/src/components/JournalStats.tsx": "Empty file with no content.",
  "frontend/src/components/Layout.tsx": "Main layout component with sticky header containing navigation links, theme toggle, auth button, and mobile sheet menu with neon-themed styling and footer.",
  "frontend/src/components/MarketSentimentPanel.tsx": "Displays market sentiment analysis with fear/greed index, top gainers, and top losers in a three-card grid layout with neon-themed styling and glow effects.",
  "frontend/src/components/PatternLegend.tsx": "Renders a card showing unique detected candlestick patterns as colored badges (bullish, bearish, or neutral).",
  "frontend/src/components/PortfolioSummary.tsx": "Empty file with no content.",
  "frontend/src/components/PositionCard.tsx": "Empty file with no content.",
  "frontend/src/components/SignalBadge.tsx": "Displays a trading signal (buy/sell/hold) as a badge with icon and tooltip showing reason, confidence, and indicator details.",
  "frontend/src/components/ThemeToggle.tsx": "Provides a button to toggle between light and dark themes, syncing the preference with the backend actor when authenticated.",
  "frontend/src/components/TimeframeSelector.tsx": "Tab selector component for switching between 1H, 4H, and Daily chart timeframes.",
  "frontend/src/components/TradeCard.tsx": "Empty file with no content.",
  "frontend/src/components/TradingSignalsPanel.tsx": "Displays active trading signals and support/resistance levels in a two-card grid layout with signal badges and level prices.",
  "frontend/src/components/WatchlistPanel.tsx": "Empty file with no content.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance using React Query, handling both authenticated and anonymous actors, and invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useAlertHistory.ts": "Provides queries and mutations for managing alert history, including filtering, fetching last 24 hours, stats, saving new alerts, and clearing alerts.",
  "frontend/src/hooks/useAlertNotifications.ts": "Monitors top cryptocurrencies for trading signals and displays toast notifications while saving alerts to the backend (currently with placeholder signal checking logic).",
  "frontend/src/hooks/useChartData.ts": "Fetches OHLC data for a given coin and timeframe, then detects candlestick patterns and calculates support/resistance levels.",
  "frontend/src/hooks/useCryptoPrices.ts": "Queries top 30 cryptocurrencies with automatic refetching every 45 seconds and retry logic for failed requests.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hooks for Internet Identity authentication on ICP, providing login/logout functionality, identity state management, and AuthClient integration with delegation handling.",
  "frontend/src/hooks/useJournal.ts": "Empty file, likely a placeholder for future trading journal functionality.",
  "frontend/src/hooks/usePortfolio.ts": "Empty file, likely a placeholder for future portfolio management functionality.",
  "frontend/src/hooks/useTechnicalIndicators.ts": "React Query hook that fetches OHLC data and calculates technical indicators (RSI, MACD, SMA, EMA, Bollinger Bands) for a given cryptocurrency and timeframe.",
  "frontend/src/hooks/useTradingSignals.ts": "React Query hook that generates trading signals based on technical indicators from useTechnicalIndicators for a specific coin and timeframe.",
  "frontend/src/hooks/useWatchlist.ts": "Empty file, likely a placeholder for future watchlist functionality.",
  "frontend/src/index.css": "Tailwind CSS configuration with cyberpunk dark theme using near-black backgrounds, neon accent colors (cyan, purple, green, red), custom glow effects, and animations for a futuristic trading UI.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/Alerts.tsx": "Alert history page displaying trading signal alerts with filtering by crypto/signal type, statistics cards, and authentication requirement using Internet Identity.",
  "frontend/src/pages/CryptoDetail.tsx": "Detailed cryptocurrency view page showing price chart with candlesticks, technical indicators, trading signals, pattern legend, and AI trade analysis for a specific crypto asset.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page displaying market overview with crypto table, market sentiment panel, timeframe selector, and auto-refresh functionality every 45 seconds.",
  "frontend/src/pages/Journal.tsx": "Empty file, likely a placeholder for future trading journal page.",
  "frontend/src/pages/Portfolio.tsx": "Empty file, likely a placeholder for future portfolio management page.",
  "frontend/src/services/coingecko.ts": "CoinGecko API service providing functions to fetch top cryptocurrency market data and OHLC (Open-High-Low-Close) price data for technical analysis.",
  "frontend/src/utils/aiTradeRecommendations.ts": "Generates AI-powered trade recommendations with entry points, take-profit targets (conservative/moderate/aggressive), stop-loss levels, confidence scores, and risk assessments based on technical indicators, trading signals, candlestick patterns, and support/resistance levels.",
  "frontend/src/utils/candlestickPatterns.ts": "Detects candlestick patterns (Doji, Hammer, Shooting Star, Bullish/Bearish Engulfing) from OHLC data and classifies them as bullish, bearish, or neutral with descriptions.",
  "frontend/src/utils/marketSentiment.ts": "Calculates overall market sentiment (bullish/bearish/neutral), fear/greed index, and identifies top gainers and losers based on 24h price changes across cryptocurrencies.",
  "frontend/src/utils/supportResistance.ts": "Identifies support and resistance levels by detecting local minima and maxima in OHLC data, merges similar levels within a 2% threshold, and ranks them by strength.",
  "frontend/src/utils/technicalIndicators.ts": "Implements technical indicator calculations including RSI, MACD, SMA, EMA, and Bollinger Bands using historical price data.",
  "frontend/src/utils/tradingSignals.ts": "Generates buy/sell/hold trading signals with confidence levels based on RSI oversold/overbought conditions and MACD crossovers.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with cyberpunk theme featuring custom neon colors (cyan, purple, green, red), custom fonts (Rajdhani, JetBrains Mono), extended color palette with OKLCH color space, and custom animations including pulse-glow and fade-in effects.",
  "project_state.json": "Project state document describing a crypto swing trading dashboard with cyberpunk UI, real-time price tracking for 20-30 cryptocurrencies, technical indicators, trading signals, CoinGecko API integration, Motoko backend, and Internet Identity authentication; notes known issues with API rate limiting and missing entry point display in AI Trade Analysis."
}