{
  "backend/main.mo": "Main Motoko actor defining user data types (portfolio, watchlist, journal, preferences, alerts) and backend functions for authentication, news/price fetching via HTTP outcalls, position/watchlist/journal management, and alert history tracking.",
  "feature_evidence.json": "Feature evidence report documenting implemented features including retry buttons, exponential backoff, request batching, timeframe selector, and AI trade analysis with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files including pages, components, hooks, services, and utilities for the crypto trading application with React Query, technical indicators, and authentication.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI elements like background, foreground, primary, secondary, destructive, borders, and chart colors.",
  "frontend/index.html": "HTML entry point for the Crypto Swing Trader application with root div and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for Dashboard, CryptoDetail, Portfolio, Journal, and Alerts pages, wrapped in ThemeProvider and including Toaster for notifications.",
  "frontend/src/components/AddPositionDialog.tsx": "Dialog component for adding portfolio positions with cryptocurrency selection dropdown and quantity input, using usePortfolio hook for mutation and toast notifications.",
  "frontend/src/components/AddTradeDialog.tsx": "Dialog component for adding new trades to the journal with form inputs for crypto, direction, prices, quantity, date, rationale, and notes. Validates inputs and submits trade data via useJournal hook.",
  "frontend/src/components/AITradeAnalysisCard.tsx": "Card component displaying AI-generated trade recommendations with direction, confidence score, risk level, entry/exit prices, stop-loss/take-profit levels, and supporting reasons based on technical indicators and patterns.",
  "frontend/src/components/AlertCard.tsx": "Card component displaying a single trading alert with crypto info, signal badge (buy/sell/hold), price, timestamp, confidence, and trigger reason. Formats alert data and matches crypto details from provided list.",
  "frontend/src/components/AlertFilters.tsx": "Filter controls for alerts page with dropdowns for cryptocurrency and signal type selection, plus a reset button. Manages filter state through callback props.",
  "frontend/src/components/AuthButton.tsx": "Authentication button that toggles between login and logout states using Internet Identity. Initializes user preferences on first login.",
  "frontend/src/components/CandlestickChart.tsx": "Line chart component using Recharts to display OHLC price data with optional support/resistance levels as reference lines. Transforms timestamp data for display.",
  "frontend/src/components/CryptoTable.tsx": "Table component displaying cryptocurrency market data with columns for rank, name, price, 24h change, volume, market cap, and trading signals. Includes watchlist toggle functionality and links to detail pages.",
  "frontend/src/components/IndicatorsPanel.tsx": "Dashboard panel displaying technical indicators (RSI, MACD, Moving Averages, Bollinger Bands) in a grid of cards with color-coded values and interpretations.",
  "frontend/src/components/JournalFilters.tsx": "Filter controls for the trading journal with search input and outcome dropdown (all/profit/loss). Updates filters through callback prop.",
  "frontend/src/components/JournalStats.tsx": "Displays trading journal statistics in a 4-card grid showing total trades, win rate, total P/L, and average P/L calculated from completed trades.",
  "frontend/src/components/Layout.tsx": "Main application layout component with sticky header navigation, mobile sheet menu, theme toggle, auth button, and footer with caffeine.ai attribution.",
  "frontend/src/components/MarketSentimentPanel.tsx": "Displays market sentiment analysis in a 3-card grid showing overall sentiment with fear/greed index, top gainers, and top losers based on 24h price changes.",
  "frontend/src/components/PatternLegend.tsx": "Shows detected candlestick patterns as colored badges (bullish, bearish, or neutral) in a card component.",
  "frontend/src/components/PortfolioSummary.tsx": "Displays portfolio overview in a 3-card grid showing total value, number of positions, and average position size.",
  "frontend/src/components/PositionCard.tsx": "Card component displaying a single portfolio position with crypto name/image, quantity, current price, total value, and a delete button.",
  "frontend/src/components/SignalBadge.tsx": "Badge component with tooltip showing trading signal type (buy/sell/hold), reason, confidence level, and indicator name.",
  "frontend/src/components/ThemeToggle.tsx": "Theme toggle button that switches between light/dark mode and persists preference to backend via Internet Identity actor.",
  "frontend/src/components/TimeframeSelector.tsx": "Tab selector component for choosing chart timeframe between 1H, 4H, and Daily intervals.",
  "frontend/src/components/TradeCard.tsx": "Card displaying individual trade details including entry/exit prices, quantity, P/L, direction indicator, rationale, notes, and delete button.",
  "frontend/src/components/TradingSignalsPanel.tsx": "Two-column panel showing active trading signals with badges and support/resistance levels detected for the current asset.",
  "frontend/src/components/WatchlistPanel.tsx": "Displays a user's cryptocurrency watchlist with prices and 24h changes, allowing removal of items and retry on error. Shows nothing if user is not authenticated or watchlist is empty.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an ICP actor instance based on Internet Identity authentication state, automatically invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAlertHistory.ts": "Provides queries and mutations for managing trading alerts including history, 24-hour alerts, statistics, saving new alerts, and clearing all alerts.",
  "frontend/src/hooks/useAlertNotifications.ts": "Monitors top cryptocurrencies for trading signals and displays toast notifications when signals are detected, saving them to the backend. Currently has placeholder logic for actual signal checking.",
  "frontend/src/hooks/useChartData.ts": "Fetches OHLC data for a cryptocurrency and calculates candlestick patterns and support/resistance levels based on the selected timeframe.",
  "frontend/src/hooks/useCryptoPrices.ts": "Queries the top 30 cryptocurrencies with market data, refreshing every 45 seconds with retry logic on failure.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and session lifecycle.",
  "frontend/src/hooks/useJournal.ts": "Manages trading journal entries with filtering by search term, cryptocurrency, and profit/loss outcome, providing add and remove mutations.",
  "frontend/src/hooks/usePortfolio.ts": "Queries and mutates user portfolio positions, providing methods to add and remove cryptocurrency holdings.",
  "frontend/src/hooks/useTechnicalIndicators.ts": "Calculates technical indicators (RSI, MACD, SMA, EMA, Bollinger Bands) from OHLC data for a given cryptocurrency and timeframe.",
  "frontend/src/hooks/useTradingSignals.ts": "Generates trading signals based on technical indicators for a specific cryptocurrency and timeframe.",
  "frontend/src/hooks/useWatchlist.ts": "React hook that manages cryptocurrency watchlist functionality using React Query, providing methods to fetch, add, remove, and check if coins are in the user's watchlist.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components, charts, and typography styles.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/pages/Alerts.tsx": "Alert history page displaying trading signal statistics (buy/sell/hold counts) with filtering capabilities and authentication requirement.",
  "frontend/src/pages/CryptoDetail.tsx": "Detailed cryptocurrency view page showing price charts, technical indicators, trading signals, candlestick patterns, and AI trade analysis with timeframe selection.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page displaying market overview with cryptocurrency table, watchlist panel, market sentiment, and auto-refresh functionality every 45 seconds.",
  "frontend/src/pages/Journal.tsx": "Trading journal page for authenticated users to log and track trades with statistics, filters, and performance analysis.",
  "frontend/src/pages/Portfolio.tsx": "Portfolio management page for authenticated users to track cryptocurrency holdings, view position cards, and see portfolio summary with profit/loss calculations.",
  "frontend/src/services/coingecko.ts": "CoinGecko API service providing functions to fetch top cryptocurrency market data and OHLC (candlestick) price data with TypeScript interfaces.",
  "frontend/src/utils/aiTradeRecommendations.ts": "Generates AI-powered trade recommendations with entry points, take-profit targets (conservative/moderate/aggressive), stop-loss levels, confidence scores, and risk assessments based on technical indicators, trading signals, candlestick patterns, and support/resistance levels.",
  "frontend/src/utils/candlestickPatterns.ts": "Detects candlestick patterns (Doji, Hammer, Shooting Star, Bullish/Bearish Engulfing) from OHLC data and classifies them as bullish, bearish, or neutral with descriptions.",
  "frontend/src/utils/marketSentiment.ts": "Calculates overall market sentiment (bullish/bearish/neutral), fear/greed index, and identifies top gainers and losers based on 24-hour price changes across cryptocurrencies.",
  "frontend/src/utils/supportResistance.ts": "Identifies support and resistance levels by detecting local minima and maxima in OHLC data, merges similar levels within a 2% threshold, and ranks them by strength.",
  "frontend/src/utils/technicalIndicators.ts": "Implements technical indicator calculations including RSI, MACD, SMA, EMA, and Bollinger Bands using historical price data arrays.",
  "frontend/src/utils/tradingSignals.ts": "Generates trading signals (buy/sell/hold) with confidence levels based on RSI oversold/overbought conditions and MACD crossovers from technical indicators.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions for colors (using OKLCH), fonts (Inter, JetBrains Mono), animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata defining a crypto swing trading dashboard with features including real-time price tracking, technical indicators, portfolio tracking, Internet Identity authentication, CoinGecko API integration, and known API rate limiting issues."
}