{
  "backend/main.mo": "Main Motoko backend actor providing user authentication, preferences management, HTTP outcalls for crypto news and price data, alert history persistence, and transformation functions for external API responses.",
  "feature_evidence.json": "Feature evidence report documenting implemented visual chart markers (entry points, take-profit levels, stop-loss markers) on the CandlestickChart component with neon cyberpunk styling and glow effects.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend TypeScript/React files including pages, components, hooks, services, and utility modules for technical analysis, trading signals, and chart functionality.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark theme color schemes using oklch color space, including cyberpunk-themed chart and sidebar colors.",
  "frontend/index.html": "HTML entry point loading Rajdhani and JetBrains Mono fonts from Google Fonts and mounting the React application at the root div.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for Dashboard, CryptoDetail, and Alerts pages, wrapped in ThemeProvider (forced dark mode) and Toaster for notifications.",
  "frontend/src/components/AddPositionDialog.tsx": "Empty file placeholder for add position dialog component.",
  "frontend/src/components/AddTradeDialog.tsx": "Empty file placeholder for add trade dialog component.",
  "frontend/src/components/AITradeAnalysisCard.tsx": "Card component displaying AI-generated trade recommendations with direction, confidence score, risk level, entry/exit prices, stop-loss, take-profit targets, and reasoning based on technical indicators and patterns.",
  "frontend/src/components/AlertCard.tsx": "Displays an individual alert card with crypto information, signal type (buy/sell/hold), trigger reason, timestamp, and visual styling including glow effects and color coding based on signal type.",
  "frontend/src/components/AlertFilters.tsx": "Provides filter controls for alerts by cryptocurrency and signal type (buy/sell/hold) with a reset button to clear all filters.",
  "frontend/src/components/AuthButton.tsx": "Renders login/logout button using Internet Identity authentication and initializes user preferences (theme, notifications) on first login.",
  "frontend/src/components/CandlestickChart.tsx": "Displays a line chart with price data, technical indicators, candlestick patterns, support/resistance levels, and trade recommendations with interactive markers and tooltips.",
  "frontend/src/components/CryptoTable.tsx": "Renders a table of cryptocurrencies with market data (price, 24h change, volume, market cap) and trading signals generated from technical indicators for each coin.",
  "frontend/src/components/IndicatorsPanel.tsx": "Displays technical indicator values (RSI, MACD, Moving Averages, Bollinger Bands) in a grid of cards with color-coded values and status labels.",
  "frontend/src/components/JournalFilters.tsx": "Empty file with no content.",
  "frontend/src/components/JournalStats.tsx": "Empty file with no content.",
  "frontend/src/components/Layout.tsx": "Provides the main application layout with header navigation (Market, Alerts), theme toggle, authentication button, mobile menu sheet, and footer with attribution.",
  "frontend/src/components/MarketSentimentPanel.tsx": "Displays market sentiment analysis with fear/greed index, top gainers, and top losers in a three-card grid layout with neon-themed styling and glow effects.",
  "frontend/src/components/PatternLegend.tsx": "Shows detected candlestick patterns as colored badges (bullish, bearish, or neutral) in a card component.",
  "frontend/src/components/PortfolioSummary.tsx": "Empty file with no content.",
  "frontend/src/components/PositionCard.tsx": "Empty file with no content.",
  "frontend/src/components/SignalBadge.tsx": "Renders a trading signal (buy/sell/hold) as a badge with icon and tooltip showing signal details like reason, confidence, and indicator.",
  "frontend/src/components/ThemeToggle.tsx": "Theme toggle button that switches between dark/light modes and persists user preference to backend via Internet Identity authentication.",
  "frontend/src/components/TimeframeSelector.tsx": "Tab selector component for switching between 1H, 4H, and Daily chart timeframes.",
  "frontend/src/components/TradeCard.tsx": "Empty file with no content.",
  "frontend/src/components/TradingSignalsPanel.tsx": "Displays active trading signals and support/resistance levels in a two-card grid layout with signal badges and price levels.",
  "frontend/src/components/WatchlistPanel.tsx": "Empty file with no content.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages an authenticated or anonymous backend actor based on Internet Identity state, invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useAlertHistory.ts": "Provides hooks for fetching alert history with filters, last 24 hours alerts, alert statistics, and mutations for saving and clearing alerts via the backend actor.",
  "frontend/src/hooks/useAlertNotifications.ts": "Monitors top cryptocurrencies for trading signals and displays toast notifications while saving alerts to backend, checking every 60 seconds.",
  "frontend/src/hooks/useChartData.ts": "Fetches OHLC data for a cryptocurrency, detects candlestick patterns, and calculates support/resistance levels based on selected timeframe.",
  "frontend/src/hooks/useCryptoPrices.ts": "React Query hook that fetches top 30 cryptocurrencies market data with 45-second auto-refresh and retry logic.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useJournal.ts": "Empty file placeholder for journal-related hooks.",
  "frontend/src/hooks/usePortfolio.ts": "Empty file placeholder for portfolio-related hooks.",
  "frontend/src/hooks/useTechnicalIndicators.ts": "React Query hook that fetches OHLC data and calculates technical indicators (RSI, MACD, SMA, EMA, Bollinger Bands) for a given coin and timeframe.",
  "frontend/src/hooks/useTradingSignals.ts": "React Query hook that generates trading signals based on technical indicators from useTechnicalIndicators for a specific coin and timeframe.",
  "frontend/src/hooks/useWatchlist.ts": "Empty file placeholder for watchlist-related hooks.",
  "frontend/src/index.css": "Tailwind CSS configuration with cyberpunk dark theme using near-black backgrounds, neon accent colors (cyan, purple, green, red), and custom glow effects with animations.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/Alerts.tsx": "Alert history page displaying trading signal alerts with filtering by crypto/signal type, statistics cards, and authentication requirement using Internet Identity.",
  "frontend/src/pages/CryptoDetail.tsx": "Detailed cryptocurrency page showing candlestick charts, technical indicators, trading signals, pattern detection, and AI trade recommendations with timeframe selection.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page displaying market overview with crypto table, market sentiment panel, timeframe selector, and auto-refresh every 45 seconds.",
  "frontend/src/pages/Journal.tsx": "Empty file placeholder for trading journal page.",
  "frontend/src/pages/Portfolio.tsx": "Empty file placeholder for portfolio management page.",
  "frontend/src/services/coingecko.ts": "CoinGecko API service providing functions to fetch top cryptocurrencies market data and OHLC (candlestick) data for technical analysis.",
  "frontend/src/utils/aiTradeRecommendations.ts": "Generates AI-powered trade recommendations with entry points, take-profit targets (conservative/moderate/aggressive), stop-loss levels, confidence scores, and risk assessments based on technical indicators, trading signals, candlestick patterns, and support/resistance levels.",
  "frontend/src/utils/candlestickPatterns.ts": "Detects candlestick patterns (Doji, Hammer, Shooting Star, Bullish/Bearish Engulfing) from OHLC data and provides trading action recommendations for each identified pattern.",
  "frontend/src/utils/marketSentiment.ts": "Calculates overall market sentiment (bullish/bearish/neutral), fear/greed index, and identifies top gainers and losers based on 24-hour price changes across tracked cryptocurrencies.",
  "frontend/src/utils/supportResistance.ts": "Identifies support and resistance levels by detecting local minima and maxima in OHLC data, merges similar levels within a 2% threshold, and ranks them by strength.",
  "frontend/src/utils/technicalIndicators.ts": "Implements calculations for technical indicators including RSI, MACD, SMA, EMA, and Bollinger Bands using historical price data arrays.",
  "frontend/src/utils/tradingSignals.ts": "Generates buy/sell/hold trading signals with confidence levels based on RSI oversold/overbought conditions and MACD crossovers from technical indicators.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with cyberpunk theme featuring custom neon colors (cyan, purple, green, red), custom fonts (Rajdhani, JetBrains Mono), extended color palette with OKLCH values, and custom animations including pulse-glow and fade-in effects.",
  "project_state.json": "Project state document describing a crypto swing trading dashboard with cyberpunk UI, real-time price tracking for 20-30 cryptocurrencies, technical indicators, trading signals, CoinGecko API integration, Motoko backend, and Internet Identity authentication."
}