{
  "kind": "build_request",
  "title": "Display entry point in AI Trade Analysis card",
  "projectName": "Crypto Swing Trader",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-31",
      "text": "Update the AITradeAnalysisCard component (frontend/src/components/AITradeAnalysisCard.tsx) to prominently display the entry point price at the top of the card, above the take-profit targets. The entry point should include: the price value with appropriate formatting, color coding (green for buy entry, red for sell/short entry based on recommendation direction), a label 'Entry Point', and the entry reasoning text if available. Ensure the entry point section uses clear visual hierarchy with appropriate spacing, icons, and typography to make it immediately visible to users.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-go-ahead"
        ],
        "quotes": [
          "i click on the crypto it take me to a page and give me all the info on that crypto and ai trade analysis give me take profit and stoploss but not entry"
        ]
      },
      "acceptanceCriteria": [
        "Entry point price is displayed at the top of the AI Trade Analysis card",
        "Entry point section appears above take-profit targets section",
        "Entry point has clear label 'Entry Point' or similar",
        "Entry point price is color-coded green for buy, red for sell/short",
        "Entry reasoning text is displayed if available in the recommendation object",
        "Visual hierarchy makes entry point immediately visible (appropriate font size, spacing, icons)",
        "Entry point formatting matches the existing price display patterns in the card"
      ]
    }
  ],
  "constraints": [
    "Do not modify the generateTradeRecommendation function in frontend/src/utils/aiTradeRecommendations.ts - it already calculates the entry point correctly",
    "Maintain consistency with existing UI patterns in the AITradeAnalysisCard component",
    "Preserve all existing functionality (take-profit targets, stop-loss, confidence, risk level, reasoning)"
  ],
  "nonGoals": [
    "Changing the entry point calculation logic",
    "Modifying any other components or pages",
    "Adding new recommendation features or data points"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}