{
  "kind": "build_request",
  "title": "Enhance API reliability with advanced error recovery and caching",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-55",
      "text": "Implement staggered request sequencing in the useCryptoPrices hook to reduce initial load API pressure. When fetching cryptocurrency data on dashboard first load, introduce a small delay (100-200ms) between batches of API requests to prevent hitting CoinGecko rate limits all at once. Split the 30 coin requests into 2-3 batches that execute sequentially.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-build"
        ],
        "quotes": [
          "first load",
          "Optimized API call sequencing - Stagger requests on initial load to reduce rate limit pressure"
        ]
      },
      "acceptanceCriteria": [
        "Initial dashboard load splits API requests into sequential batches",
        "Each batch has 100-200ms delay before next batch starts",
        "Rate limit errors on first load are significantly reduced"
      ]
    },
    {
      "id": "REQ-56",
      "text": "Add client-side response caching to the coingecko.ts service using a Map-based cache with timestamps. Cache successful API responses for 30-45 seconds to prevent redundant calls when components remount or queries refetch. Include cache invalidation logic that respects the 45-second auto-refresh interval already configured in useCryptoPrices.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-build"
        ],
        "quotes": [
          "Better caching strategy - Store successful responses temporarily to reduce redundant API calls"
        ]
      },
      "acceptanceCriteria": [
        "Successful CoinGecko responses are cached for 30-45 seconds",
        "Cached data is returned immediately without making new API calls",
        "Cache respects existing 45-second auto-refresh interval",
        "Cache is properly invalidated when stale"
      ]
    },
    {
      "id": "REQ-57",
      "text": "Implement graceful partial data rendering in the CryptoTable component. When some cryptocurrency data fails to load but others succeed, display the successful data immediately instead of showing a complete error state. Add individual row-level error indicators for coins that failed to load with mini retry buttons.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-build"
        ],
        "quotes": [
          "Smarter fallback handling - Implement graceful degradation so partial data displays even if some API calls fail"
        ]
      },
      "acceptanceCriteria": [
        "Successfully loaded cryptocurrencies display immediately even if some requests fail",
        "Failed coin rows show inline error indicators with retry buttons",
        "Users can see and interact with partial data while failures are isolated",
        "Overall UX remains functional with partial data"
      ]
    },
    {
      "id": "REQ-58",
      "text": "Add enhanced retry logic specifically for initial page load in the Dashboard component. Implement a more aggressive retry strategy (4-5 attempts instead of 3) with longer backoff delays specifically when isInitialLoading is true in React Query. Display a loading overlay with progress indicator showing retry attempts during initial load.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-build"
        ],
        "quotes": [
          "first load",
          "Enhanced error recovery on initial load - Add more robust retry logic specifically for the first data fetch when the dashboard loads"
        ]
      },
      "acceptanceCriteria": [
        "Initial dashboard load uses 4-5 retry attempts instead of 3",
        "Retry delays are longer for initial load (2-5 seconds between attempts)",
        "Loading overlay shows current retry attempt number",
        "First load reliability is significantly improved"
      ]
    },
    {
      "id": "REQ-59",
      "text": "Improve chart data error handling in the useChartData hook. When OHLC data fails to fetch, implement automatic retry with exponential backoff (similar to useCryptoPrices) and display a user-friendly error message with a prominent retry button in the CandlestickChart component instead of showing blank/empty chart state.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-build"
        ],
        "quotes": [
          "No chart data available",
          "Improved chart error states - Better handling when chart data is missing, with clearer messaging and automatic retry attempts"
        ]
      },
      "acceptanceCriteria": [
        "useChartData hook implements exponential backoff retry logic",
        "CandlestickChart displays clear error message when data fails",
        "Retry button is prominently displayed in chart error state",
        "Automatic retry attempts before showing error to user"
      ]
    },
    {
      "id": "REQ-60",
      "text": "Add a global API health indicator in the Layout component header that monitors CoinGecko API availability. Display a small status badge (green=healthy, yellow=degraded, red=issues) based on recent request success rates. When API issues are detected, show a banner notification explaining that data may be temporarily unavailable with an estimated recovery time.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-build"
        ],
        "quotes": [
          "Improved error messaging with clearer user feedback"
        ]
      },
      "acceptanceCriteria": [
        "Status badge in header shows API health (green/yellow/red)",
        "Status is calculated from recent request success/failure rates",
        "Banner notification appears when API issues are widespread",
        "Users are informed proactively about data availability issues"
      ]
    },
    {
      "id": "REQ-61",
      "text": "Optimize React Query configuration in main.tsx to add smarter cache management. Increase staleTime to 30 seconds (from default) and cacheTime to 5 minutes to reduce unnecessary refetches. Add refetchOnWindowFocus: false for crypto price queries to prevent excessive API calls when user switches browser tabs.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-build"
        ],
        "quotes": [
          "Better caching strategy to reduce redundant API calls"
        ]
      },
      "acceptanceCriteria": [
        "React Query staleTime set to 30 seconds for crypto data",
        "React Query cacheTime set to 5 minutes",
        "Window focus refetch disabled for price queries",
        "Total API call volume reduced by 30-50%"
      ]
    },
    {
      "id": "REQ-62",
      "text": "Add request deduplication to the coingecko.ts service to prevent multiple identical API calls from executing simultaneously. Use a promise cache that stores in-flight requests by their URL and returns the same promise for duplicate concurrent requests.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-build"
        ],
        "quotes": [
          "reduce redundant API calls",
          "Optimized API call sequencing"
        ]
      },
      "acceptanceCriteria": [
        "Concurrent identical API requests share the same promise",
        "Only one actual HTTP request is made for duplicate concurrent calls",
        "Request deduplication works across different components",
        "No race conditions or stale data issues from deduplication"
      ]
    }
  ],
  "constraints": [
    "Maintain existing 45-second auto-refresh interval for real-time price updates",
    "Preserve current exponential backoff retry logic (do not remove, only enhance)",
    "Do not modify useInternetIdentity hook or authentication flow",
    "Keep cyberpunk UI styling consistent with existing design",
    "Ensure all improvements work on mobile devices without performance degradation"
  ],
  "nonGoals": [
    "Switching to a different cryptocurrency data API provider",
    "Implementing WebSocket connections for real-time data streaming",
    "Adding server-side caching in the Motoko backend",
    "Creating a fallback data source when CoinGecko is unavailable",
    "Implementing offline mode or service worker caching"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}