{
  "kind": "build_request",
  "title": "Add visual trading markers on candlestick charts with entry points, take-profit levels, stop-loss, and pattern tooltips",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-49",
      "text": "Add visual entry point markers directly on the CandlestickChart component. Display green upward arrows or vertical lines for long (buy) entry positions and red downward arrows or vertical lines for short (sell) entry positions. Position the markers at the exact entry price level recommended by the AI trade analysis. Use neon glow effects matching the cyberpunk aesthetic (neon green for long entries with glow shadow, neon red for short entries with glow shadow).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "Add visual markers directly on the candlestick charts showing where to enter long (buy) positions with green arrows/lines and short (sell) positions with red arrows/lines"
        ]
      },
      "acceptanceCriteria": [
        "Entry point markers appear as arrows or vertical lines on the chart at the recommended entry price",
        "Long entry markers use neon green color with glow effect",
        "Short entry markers use neon red color with glow effect",
        "Markers are clearly visible against the dark chart background",
        "Markers sync with AI trade recommendation data in real-time"
      ]
    },
    {
      "id": "REQ-50",
      "text": "Add three horizontal take-profit level lines on the CandlestickChart component corresponding to the conservative, moderate, and aggressive take-profit targets from the AI trade analysis. Display each level as a horizontal line with a label showing the target type and price. Use gradient neon colors to differentiate the three levels (e.g., dim neon green for conservative, medium intensity neon green for moderate, bright neon green for aggressive). Include subtle glow effects on the lines.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "Take-profit target levels (the 3 targets from AI analysis: conservative, moderate, aggressive)"
        ]
      },
      "acceptanceCriteria": [
        "Three horizontal lines appear on the chart at the exact take-profit target prices",
        "Each line is labeled with target type (Conservative/Moderate/Aggressive) and price value",
        "Lines use gradient neon green colors with varying intensity to differentiate targets",
        "Lines have subtle glow effects matching cyberpunk styling",
        "Lines update in real-time when AI recommendations change"
      ]
    },
    {
      "id": "REQ-51",
      "text": "Add a stop-loss level marker on the CandlestickChart component as a horizontal line positioned at the stop-loss price from the AI trade analysis. Use neon red or neon orange color with a warning icon or label. Include a glow effect to make it clearly visible. Position the line below the entry point for long positions or above the entry point for short positions.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "Stop-loss level markers clearly visible"
        ]
      },
      "acceptanceCriteria": [
        "Stop-loss level appears as a horizontal line at the recommended stop-loss price",
        "Line uses neon red or orange color with warning icon/label",
        "Line has glow effect for high visibility",
        "Line position makes logical sense relative to entry point (below for long, above for short)",
        "Line updates when AI recommendation changes"
      ]
    },
    {
      "id": "REQ-52",
      "text": "Implement pattern explanation tooltips on the CandlestickChart component that appear when hovering over detected candlestick patterns. The tooltip should display the pattern name (e.g., 'Bullish Engulfing', 'Doji', 'Hammer'), a brief description of what the pattern means, and the recommended trading action (e.g., 'Typically signals upward price movement - consider entering long position'). Style tooltips with cyberpunk dark background, neon borders, and clear typography. Position tooltips near the pattern location on the chart without obscuring price data.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "Pattern explanation tooltips that appear when you hover over detected patterns, explaining what each pattern means and what action to take"
        ]
      },
      "acceptanceCriteria": [
        "Tooltips appear on hover over detected candlestick pattern locations on the chart",
        "Tooltips show pattern name, description, and recommended trading action",
        "Tooltip styling uses cyberpunk aesthetic (dark background, neon borders, clear text)",
        "Tooltips are positioned near pattern without obscuring important chart data",
        "Tooltips display for all detected pattern types (Doji, Hammer, Engulfing, etc.)"
      ]
    },
    {
      "id": "REQ-53",
      "text": "Update the CandlestickChart component to integrate with the AI trade recommendation data from the AITradeAnalysisCard component. Ensure the chart receives the entry point price, take-profit targets (conservative/moderate/aggressive), stop-loss price, and trading direction (long/short) as props or through shared state. Synchronize the visual markers with the AI recommendation data so that markers appear/update whenever recommendations are generated or recalculated.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "visual markers directly on the candlestick charts",
          "The markers will use the cyberpunk neon styling to fit perfectly with your futuristic design"
        ]
      },
      "acceptanceCriteria": [
        "CandlestickChart component receives AI recommendation data (entry, targets, stop-loss, direction)",
        "Chart markers synchronize with AI recommendation updates in real-time",
        "Markers appear immediately when AI analysis generates new recommendations",
        "Markers clear or update when switching between different cryptocurrencies or timeframes",
        "No visual lag between recommendation generation and marker display"
      ]
    },
    {
      "id": "REQ-54",
      "text": "Ensure all chart markers (entry points, take-profit levels, stop-loss) remain visible and readable on mobile devices. Optimize touch interactions for pattern tooltips on mobile (tap to show instead of hover). Scale marker sizes and label fonts appropriately for smaller screens. Test on various mobile screen sizes to ensure markers do not overlap or obscure critical chart data.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent"
        ]
      },
      "acceptanceCriteria": [
        "All markers are clearly visible on mobile screen sizes (320px width and up)",
        "Pattern tooltips work with tap interactions on mobile devices",
        "Marker labels use appropriate font sizes for mobile readability",
        "Markers do not overlap or obscure candlestick data on small screens",
        "Touch targets for interactive elements meet minimum 44x44px size requirement"
      ]
    }
  ],
  "constraints": [
    "Do not modify the existing support/resistance level display logic on charts",
    "Maintain the cyberpunk aesthetic with neon glow effects for all new chart markers",
    "Ensure chart performance remains smooth (60fps) with all markers and tooltips displayed",
    "Use the existing AI trade recommendation data structure from aiTradeRecommendations.ts"
  ],
  "nonGoals": [
    "Adding new technical indicators beyond what already exists",
    "Modifying the AI recommendation generation logic itself",
    "Changing the existing candlestick pattern detection algorithms",
    "Adding manual trade entry/annotation features on charts"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}