{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add visual trading markers on candlestick charts with entry points, take-profit levels, stop-loss, and pattern tooltips",
  "requirements": [
    {
      "id": "REQ-49",
      "summary": "Add visual entry point markers directly on the CandlestickChart component with neon glow effects for long and short positions",
      "acceptanceCriteria": [
        "Entry point markers appear as arrows or vertical lines on the chart at the recommended entry price",
        "Long entry markers use neon green color with glow effect",
        "Short entry markers use neon red color with glow effect",
        "Markers are clearly visible against the dark chart background",
        "Markers sync with AI trade recommendation data in real-time"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/CandlestickChart.tsx",
          "operation": "modify",
          "description": "Add entry point markers (green upward arrows for long, red downward arrows for short) using Recharts ReferenceDot or custom SVG shapes. Accept AI trade recommendation data as props (entryPrice, direction). Position markers at exact entry price level with neon glow effects (shadow-[0_0_10px_rgba(0,255,0,0.6)] for long, shadow-[0_0_10px_rgba(255,0,0,0.6)] for short). Render markers on the chart using ReferenceDot with custom shape prop or add custom SVG layer."
        }
      ]
    },
    {
      "id": "REQ-50",
      "summary": "Add three horizontal take-profit level lines on the CandlestickChart with gradient neon colors and labels",
      "acceptanceCriteria": [
        "Three horizontal lines appear on the chart at the exact take-profit target prices",
        "Each line is labeled with target type (Conservative/Moderate/Aggressive) and price value",
        "Lines use gradient neon green colors with varying intensity to differentiate targets",
        "Lines have subtle glow effects matching cyberpunk styling",
        "Lines update in real-time when AI recommendations change"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/CandlestickChart.tsx",
          "operation": "modify",
          "description": "Add three horizontal take-profit level lines using Recharts ReferenceLine components. Accept takeProfitTargets prop containing conservative, moderate, and aggressive target prices. Style each line with different neon green intensities: dim (#22c55e with 40% opacity) for conservative, medium (#22c55e with 70% opacity) for moderate, bright (#22c55e with 100% opacity + glow) for aggressive. Add labels showing target type and price using the label prop of ReferenceLine. Apply glow effects using strokeWidth and custom stroke colors."
        }
      ]
    },
    {
      "id": "REQ-51",
      "summary": "Add stop-loss level marker on the CandlestickChart as a horizontal line with warning styling",
      "acceptanceCriteria": [
        "Stop-loss level appears as a horizontal line at the recommended stop-loss price",
        "Line uses neon red or orange color with warning icon/label",
        "Line has glow effect for high visibility",
        "Line position makes logical sense relative to entry point (below for long, above for short)",
        "Line updates when AI recommendation changes"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/CandlestickChart.tsx",
          "operation": "modify",
          "description": "Add stop-loss horizontal line using Recharts ReferenceLine component. Accept stopLossPrice and direction props. Style with neon red (#ef4444) or orange (#f97316) color and glow effect (strokeWidth: 2, stroke with shadow). Add label with warning icon (⚠️) and price value. Ensure line positioning is logical: below entry for long positions, above entry for short positions."
        }
      ]
    },
    {
      "id": "REQ-52",
      "summary": "Implement pattern explanation tooltips on the CandlestickChart that appear when hovering over detected candlestick patterns",
      "acceptanceCriteria": [
        "Tooltips appear on hover over detected candlestick pattern locations on the chart",
        "Tooltips show pattern name, description, and recommended trading action",
        "Tooltip styling uses cyberpunk aesthetic (dark background, neon borders, clear text)",
        "Tooltips are positioned near pattern without obscuring important chart data",
        "Tooltips display for all detected pattern types (Doji, Hammer, Engulfing, etc.)"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/CandlestickChart.tsx",
          "operation": "modify",
          "description": "Add pattern tooltip functionality by rendering invisible overlay markers at detected pattern locations using ReferenceDot or custom SVG. Accept detectedPatterns prop containing pattern data (timestamp, type, description, sentiment). On hover, display custom tooltip with pattern name, description, and recommended action (e.g., 'Bullish Engulfing typically signals upward price movement - consider entering long position'). Style tooltip with dark background (bg-background/95), neon cyan border (border-2 border-neon-cyan), and clear text (text-foreground). Position tooltip near pattern location using Recharts Tooltip component or custom positioned div."
        },
        {
          "path": "frontend/src/utils/candlestickPatterns.ts",
          "operation": "modify",
          "description": "Extend pattern detection functions to include recommended trading actions for each pattern type. Add tradingAction field to pattern objects with values like 'Consider entering long position', 'Wait for confirmation', 'Consider short position', etc. based on pattern sentiment (bullish/bearish/neutral)."
        }
      ]
    },
    {
      "id": "REQ-53",
      "summary": "Update the CandlestickChart component to integrate with AI trade recommendation data and synchronize visual markers",
      "acceptanceCriteria": [
        "CandlestickChart component receives AI recommendation data (entry, targets, stop-loss, direction)",
        "Chart markers synchronize with AI recommendation updates in real-time",
        "Markers appear immediately when AI analysis generates new recommendations",
        "Markers clear or update when switching between different cryptocurrencies or timeframes",
        "No visual lag between recommendation generation and marker display"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/CandlestickChart.tsx",
          "operation": "modify",
          "description": "Add new props to CandlestickChart component: tradeRecommendation (containing entryPrice, direction, takeProfitTargets, stopLossPrice) and detectedPatterns. Update component to conditionally render all markers only when tradeRecommendation is provided. Use React key prop with coin+timeframe to force re-render when switching cryptocurrencies or timeframes, ensuring markers clear/update properly."
        },
        {
          "path": "frontend/src/pages/CryptoDetail.tsx",
          "operation": "modify",
          "description": "Wire AI trade recommendation data from AITradeAnalysisCard to CandlestickChart component. Extract trade recommendation data from the generateAITradeRecommendation result and pass it as props to CandlestickChart. Also pass detected patterns from useChartData hook. Ensure data flows properly so chart markers update whenever recommendations are regenerated or when coin/timeframe changes."
        }
      ]
    },
    {
      "id": "REQ-54",
      "summary": "Ensure all chart markers remain visible and readable on mobile devices with optimized touch interactions",
      "acceptanceCriteria": [
        "All markers are clearly visible on mobile screen sizes (320px width and up)",
        "Pattern tooltips work with tap interactions on mobile devices",
        "Marker labels use appropriate font sizes for mobile readability",
        "Markers do not overlap or obscure candlestick data on small screens",
        "Touch targets for interactive elements meet minimum 44x44px size requirement"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/CandlestickChart.tsx",
          "operation": "modify",
          "description": "Add responsive styling for mobile devices using Tailwind responsive classes. Scale marker sizes and label fonts for screens <640px (text-xs on mobile, text-sm on desktop). Implement touch event handling for pattern tooltips using onTouchStart/onTouchEnd in addition to onMouseEnter/onMouseLeave. Ensure interactive overlay elements have minimum touch target size of 44x44px using w-11 h-11 or larger. Test marker positioning to prevent overlap with candlestick data by adjusting label offsets on small screens."
        }
      ]
    }
  ]
}